Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_68 (Conv2D)           (None, 32, 32, 64)        1792      
_________________________________________________________________
conv2d_69 (Conv2D)           (None, 32, 32, 64)        36928     
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_70 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
conv2d_71 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
global_average_pooling2d_17  (None, 128)               0         
_________________________________________________________________
dense_51 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_34 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_52 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_35 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_53 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 361,289
Trainable params: 361,289
Non-trainable params: 0
_________________________________________________________________
