Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_72 (Conv2D)           (None, 32, 32, 64)        1792      
_________________________________________________________________
conv2d_73 (Conv2D)           (None, 32, 32, 64)        36928     
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_74 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
conv2d_75 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
global_average_pooling2d_18  (None, 128)               0         
_________________________________________________________________
dense_54 (Dense)             (None, 1024)              132096    
_________________________________________________________________
dropout_36 (Dropout)         (None, 1024)              0         
_________________________________________________________________
dense_55 (Dense)             (None, 1024)              1049600   
_________________________________________________________________
dropout_37 (Dropout)         (None, 1024)              0         
_________________________________________________________________
dense_56 (Dense)             (None, 9)                 9225      
=================================================================
Total params: 1,451,081
Trainable params: 1,451,081
Non-trainable params: 0
_________________________________________________________________
