Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_78 (Conv2D)           (None, 32, 32, 64)        1792      
_________________________________________________________________
conv2d_79 (Conv2D)           (None, 32, 32, 64)        36928     
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_80 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
conv2d_81 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
global_average_pooling2d_12  (None, 128)               0         
_________________________________________________________________
dense_36 (Dense)             (None, 512)               66048     
_________________________________________________________________
dropout_24 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_37 (Dense)             (None, 512)               262656    
_________________________________________________________________
dropout_25 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_38 (Dense)             (None, 9)                 4617      
=================================================================
Total params: 593,481
Trainable params: 593,481
Non-trainable params: 0
_________________________________________________________________
