Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_94 (Conv2D)           (None, 32, 32, 64)        3136      
_________________________________________________________________
conv2d_95 (Conv2D)           (None, 32, 32, 64)        65600     
_________________________________________________________________
max_pooling2d_32 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_96 (Conv2D)           (None, 16, 16, 128)       131200    
_________________________________________________________________
conv2d_97 (Conv2D)           (None, 16, 16, 128)       262272    
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_98 (Conv2D)           (None, 8, 8, 256)         524544    
_________________________________________________________________
conv2d_99 (Conv2D)           (None, 8, 8, 256)         1048832   
_________________________________________________________________
global_average_pooling2d_15  (None, 256)               0         
_________________________________________________________________
dense_45 (Dense)             (None, 512)               131584    
_________________________________________________________________
dropout_30 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_46 (Dense)             (None, 512)               262656    
_________________________________________________________________
dropout_31 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_47 (Dense)             (None, 9)                 4617      
=================================================================
Total params: 2,434,441
Trainable params: 2,434,441
Non-trainable params: 0
_________________________________________________________________
