Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_48 (Conv2D)           (None, 32, 32, 64)        1792      
_________________________________________________________________
conv2d_49 (Conv2D)           (None, 32, 32, 64)        36928     
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_50 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
conv2d_51 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_52 (Conv2D)           (None, 8, 8, 256)         295168    
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 8, 8, 256)         590080    
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 4, 4, 256)         0         
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 4, 4, 512)         1180160   
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 4, 4, 512)         2359808   
_________________________________________________________________
global_average_pooling2d_8 ( (None, 512)               0         
_________________________________________________________________
dense_24 (Dense)             (None, 128)               65664     
_________________________________________________________________
dropout_16 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_25 (Dense)             (None, 128)               16512     
_________________________________________________________________
dropout_17 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_26 (Dense)             (None, 9)                 1161      
=================================================================
Total params: 4,768,713
Trainable params: 4,768,713
Non-trainable params: 0
_________________________________________________________________
