Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_114 (Conv2D)          (None, 32, 32, 64)        3136      
_________________________________________________________________
conv2d_115 (Conv2D)          (None, 32, 32, 64)        65600     
_________________________________________________________________
max_pooling2d_39 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_116 (Conv2D)          (None, 16, 16, 128)       131200    
_________________________________________________________________
conv2d_117 (Conv2D)          (None, 16, 16, 128)       262272    
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_118 (Conv2D)          (None, 8, 8, 256)         524544    
_________________________________________________________________
conv2d_119 (Conv2D)          (None, 8, 8, 256)         1048832   
_________________________________________________________________
global_average_pooling2d_18  (None, 256)               0         
_________________________________________________________________
dense_54 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_36 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_55 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_37 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_56 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 2,169,481
Trainable params: 2,169,481
Non-trainable params: 0
_________________________________________________________________
