Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_100 (Conv2D)          (None, 32, 32, 64)        1792      
_________________________________________________________________
conv2d_101 (Conv2D)          (None, 32, 32, 64)        36928     
_________________________________________________________________
max_pooling2d_34 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_102 (Conv2D)          (None, 16, 16, 128)       73856     
_________________________________________________________________
conv2d_103 (Conv2D)          (None, 16, 16, 128)       147584    
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_104 (Conv2D)          (None, 8, 8, 256)         295168    
_________________________________________________________________
conv2d_105 (Conv2D)          (None, 8, 8, 256)         590080    
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 4, 4, 256)         0         
_________________________________________________________________
conv2d_106 (Conv2D)          (None, 4, 4, 512)         1180160   
_________________________________________________________________
conv2d_107 (Conv2D)          (None, 4, 4, 512)         2359808   
_________________________________________________________________
global_average_pooling2d_16  (None, 512)               0         
_________________________________________________________________
dense_48 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_32 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_49 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_33 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_50 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 4,884,809
Trainable params: 4,884,809
Non-trainable params: 0
_________________________________________________________________
