Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_64 (Conv2D)           (None, 32, 32, 64)        1792      
_________________________________________________________________
conv2d_65 (Conv2D)           (None, 32, 32, 64)        36928     
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_66 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
conv2d_67 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
global_average_pooling2d_16  (None, 128)               0         
_________________________________________________________________
dense_48 (Dense)             (None, 512)               66048     
_________________________________________________________________
dropout_32 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_49 (Dense)             (None, 512)               262656    
_________________________________________________________________
dropout_33 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_50 (Dense)             (None, 9)                 4617      
=================================================================
Total params: 593,481
Trainable params: 593,481
Non-trainable params: 0
_________________________________________________________________
