Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_24 (Conv2D)           (None, 32, 32, 128)       3584      
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 32, 32, 128)       147584    
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 16, 16, 256)       295168    
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 16, 16, 256)       590080    
_________________________________________________________________
global_average_pooling2d_6 ( (None, 256)               0         
_________________________________________________________________
dense_18 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_12 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_13 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_20 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 1,170,313
Trainable params: 1,170,313
Non-trainable params: 0
_________________________________________________________________
