Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_108 (Conv2D)          (None, 32, 32, 64)        1792      
_________________________________________________________________
conv2d_109 (Conv2D)          (None, 32, 32, 64)        36928     
_________________________________________________________________
max_pooling2d_37 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_110 (Conv2D)          (None, 16, 16, 128)       73856     
_________________________________________________________________
conv2d_111 (Conv2D)          (None, 16, 16, 128)       147584    
_________________________________________________________________
max_pooling2d_38 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_112 (Conv2D)          (None, 8, 8, 256)         295168    
_________________________________________________________________
conv2d_113 (Conv2D)          (None, 8, 8, 256)         590080    
_________________________________________________________________
global_average_pooling2d_17  (None, 256)               0         
_________________________________________________________________
dense_51 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_34 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_52 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_35 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_53 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 1,279,305
Trainable params: 1,279,305
Non-trainable params: 0
_________________________________________________________________
