Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_70 (Conv2D)           (None, 32, 32, 64)        3136      
_________________________________________________________________
conv2d_71 (Conv2D)           (None, 32, 32, 64)        65600     
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_72 (Conv2D)           (None, 16, 16, 128)       131200    
_________________________________________________________________
conv2d_73 (Conv2D)           (None, 16, 16, 128)       262272    
_________________________________________________________________
max_pooling2d_25 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_74 (Conv2D)           (None, 8, 8, 256)         524544    
_________________________________________________________________
conv2d_75 (Conv2D)           (None, 8, 8, 256)         1048832   
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 4, 4, 256)         0         
_________________________________________________________________
conv2d_76 (Conv2D)           (None, 4, 4, 512)         2097664   
_________________________________________________________________
conv2d_77 (Conv2D)           (None, 4, 4, 512)         4194816   
_________________________________________________________________
global_average_pooling2d_11  (None, 512)               0         
_________________________________________________________________
dense_33 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_22 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_34 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_23 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_35 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 8,527,497
Trainable params: 8,527,497
Non-trainable params: 0
_________________________________________________________________
