Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_56 (Conv2D)           (None, 32, 32, 64)        3136      
_________________________________________________________________
conv2d_57 (Conv2D)           (None, 32, 32, 64)        65600     
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 16, 16, 128)       131200    
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 16, 16, 128)       262272    
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 8, 8, 256)         524544    
_________________________________________________________________
conv2d_61 (Conv2D)           (None, 8, 8, 256)         1048832   
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 4, 4, 256)         0         
_________________________________________________________________
conv2d_62 (Conv2D)           (None, 4, 4, 512)         2097664   
_________________________________________________________________
conv2d_63 (Conv2D)           (None, 4, 4, 512)         4194816   
_________________________________________________________________
global_average_pooling2d_9 ( (None, 512)               0         
_________________________________________________________________
dense_27 (Dense)             (None, 512)               262656    
_________________________________________________________________
dropout_18 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_28 (Dense)             (None, 512)               262656    
_________________________________________________________________
dropout_19 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_29 (Dense)             (None, 9)                 4617      
=================================================================
Total params: 8,857,993
Trainable params: 8,857,993
Non-trainable params: 0
_________________________________________________________________
