Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_82 (Conv2D)           (None, 32, 32, 64)        1792      
_________________________________________________________________
conv2d_83 (Conv2D)           (None, 32, 32, 64)        36928     
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_84 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
conv2d_85 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_86 (Conv2D)           (None, 8, 8, 256)         295168    
_________________________________________________________________
conv2d_87 (Conv2D)           (None, 8, 8, 256)         590080    
_________________________________________________________________
max_pooling2d_30 (MaxPooling (None, 4, 4, 256)         0         
_________________________________________________________________
conv2d_88 (Conv2D)           (None, 4, 4, 512)         1180160   
_________________________________________________________________
conv2d_89 (Conv2D)           (None, 4, 4, 512)         2359808   
_________________________________________________________________
global_average_pooling2d_13  (None, 512)               0         
_________________________________________________________________
dense_39 (Dense)             (None, 512)               262656    
_________________________________________________________________
dropout_26 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_40 (Dense)             (None, 512)               262656    
_________________________________________________________________
dropout_27 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_41 (Dense)             (None, 9)                 4617      
=================================================================
Total params: 5,215,305
Trainable params: 5,215,305
Non-trainable params: 0
_________________________________________________________________
