Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_32 (Conv2D)           (None, 32, 32, 64)        3136      
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 32, 32, 64)        65600     
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 16, 16, 128)       131200    
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 16, 16, 128)       262272    
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 8, 8, 256)         524544    
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 8, 8, 256)         1048832   
_________________________________________________________________
global_average_pooling2d_5 ( (None, 256)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_10 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_11 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 2,169,481
Trainable params: 2,169,481
Non-trainable params: 0
_________________________________________________________________
