Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_90 (Conv2D)           (None, 32, 32, 64)        1792      
_________________________________________________________________
conv2d_91 (Conv2D)           (None, 32, 32, 64)        36928     
_________________________________________________________________
max_pooling2d_31 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_92 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
conv2d_93 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
global_average_pooling2d_14  (None, 128)               0         
_________________________________________________________________
dense_42 (Dense)             (None, 128)               16512     
_________________________________________________________________
dropout_28 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_43 (Dense)             (None, 128)               16512     
_________________________________________________________________
dropout_29 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_44 (Dense)             (None, 9)                 1161      
=================================================================
Total params: 294,345
Trainable params: 294,345
Non-trainable params: 0
_________________________________________________________________
