Model: "sequential_19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_120 (Conv2D)          (None, 32, 32, 64)        1792      
_________________________________________________________________
conv2d_121 (Conv2D)          (None, 32, 32, 64)        36928     
_________________________________________________________________
max_pooling2d_41 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_122 (Conv2D)          (None, 16, 16, 128)       73856     
_________________________________________________________________
conv2d_123 (Conv2D)          (None, 16, 16, 128)       147584    
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_124 (Conv2D)          (None, 8, 8, 256)         295168    
_________________________________________________________________
conv2d_125 (Conv2D)          (None, 8, 8, 256)         590080    
_________________________________________________________________
global_average_pooling2d_19  (None, 256)               0         
_________________________________________________________________
dense_57 (Dense)             (None, 128)               32896     
_________________________________________________________________
dropout_38 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_58 (Dense)             (None, 128)               16512     
_________________________________________________________________
dropout_39 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_59 (Dense)             (None, 9)                 1161      
=================================================================
Total params: 1,195,977
Trainable params: 1,195,977
Non-trainable params: 0
_________________________________________________________________
