Model: "sequential_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_126 (Conv2D)          (None, 32, 32, 64)        3136      
_________________________________________________________________
conv2d_127 (Conv2D)          (None, 32, 32, 64)        65600     
_________________________________________________________________
max_pooling2d_43 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_128 (Conv2D)          (None, 16, 16, 128)       131200    
_________________________________________________________________
conv2d_129 (Conv2D)          (None, 16, 16, 128)       262272    
_________________________________________________________________
global_average_pooling2d_20  (None, 128)               0         
_________________________________________________________________
dense_60 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_40 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_61 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_41 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_62 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 563,337
Trainable params: 563,337
Non-trainable params: 0
_________________________________________________________________
