Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_60 (Conv2D)           (None, 32, 32, 64)        1792      
_________________________________________________________________
conv2d_61 (Conv2D)           (None, 32, 32, 64)        36928     
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_62 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
conv2d_63 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
global_average_pooling2d_15  (None, 128)               0         
_________________________________________________________________
dense_45 (Dense)             (None, 512)               66048     
_________________________________________________________________
dropout_30 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_46 (Dense)             (None, 512)               262656    
_________________________________________________________________
dropout_31 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_47 (Dense)             (None, 9)                 4617      
=================================================================
Total params: 593,481
Trainable params: 593,481
Non-trainable params: 0
_________________________________________________________________
